display/app/views/records/index.html.erb

SELECT "records".* FROM "records" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "records"
---

<% if Record.count > (params[:page].to_i + 1) * 10 %>