display/app/controllers/records_controller.rb

    def index
        @records = Record.offset(10 * params[:page].to_i).limit(10)
---
SELECT "records".* FROM "records" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "records" WHERE (capital_loss != (0))