display/app/models/record.rb

    def self.summarize
        count = self.count
        mean_cap_gains = self.sum(:capital_gain) / self.where("capital_gain != (?)", 0).count
        mean_cap_losses = self.sum(:capital_loss) / self.where("capital_loss != (?)", 0).count
        response = {
            num_records: self.count,
            mean_cap_gains: mean_cap_gains,
            mean_cap_losses: mean_cap_losses,
            unique_professions: self.pluck(Arel.sql("count(distinct(occupation))")).first
---
SELECT COUNT(*) FROM "records"
SELECT COUNT(*) FROM "records" WHERE (capital_gain != (0))
SELECT COUNT(*) FROM "records" WHERE (capital_loss != (0))
SELECT count(distinct(occupation)) FROM "records"